//------------------------------------------------------------------------------
// 헤더 파일 목록.
//------------------------------------------------------------------------------
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include "list.h"


//------------------------------------------------------------------------------
// 리스트 생성.
//------------------------------------------------------------------------------
list_instance list_create() {
	list_instance instance = (list_instance)malloc(sizeof(list));
	if (instance != NULL) {
		instance->head = NULL;
	}

	return instance;
}


//------------------------------------------------------------------------------
// 리스트 파괴.
//------------------------------------------------------------------------------
void list_destroy(list_instance_ptr instance_ptr) {
	if (instance_ptr == NULL)
		return;

	list_instance instance = (list_instance)(*instance_ptr);
	if (instance != NULL) {
		free(instance);
		instance = NULL;
		*instance_ptr = NULL;
	}
}


//------------------------------------------------------------------------------
// 리스트 요소 추가.
//------------------------------------------------------------------------------
void list_add(list_instance instance, unknown_instance data)
{
}


//------------------------------------------------------------------------------
// 리스트 요소 제거.
//------------------------------------------------------------------------------
void list_remove(list_instance instance, unknown_instance data)
{
}


//------------------------------------------------------------------------------
// 리스트 요소 설정.
//------------------------------------------------------------------------------
void list_set_value(list_instance instance, uint64_t index, unknown_instance data)
{
}

//------------------------------------------------------------------------------
// 리스트 요소 반환.
//------------------------------------------------------------------------------
unknown_instance list_get_value(list_instance instance, uint64_t index)
{
	return NULL;
}


//------------------------------------------------------------------------------
// 리스트 요소 위치 반환.
//------------------------------------------------------------------------------
int64_t list_index_of(list_instance instance, unknown_instance data)
{
	return 0LU;
}