#--------------------------------------------------------------------------------
# 참조 모듈 목록.
#--------------------------------------------------------------------------------
from __future__ import annotations
from typing import Any, Final, Callable, Iterator, Optional, Type, TypeVar, Union, Tuple, List, Dict, Set, cast
import builtins


#--------------------------------------------------------------------------------
# 이곳에 패키지 안의 모듈 속 함수를 선언하면 패키지 밖에서 패키지채로 해당 함수를 호출 가능.
# - packageexmpale.Print()
#--------------------------------------------------------------------------------
from .__main__ import Print